# Pandas

# 1 - Series

In [1]:
import numpy as np
import pandas as pd

pd.Series([0.3, 0.5, 0.8])

0    0.3
1    0.5
2    0.8
dtype: float64

In [2]:
pd.Series([0.3, 0.5, 0.8], index=['3-July', '4-July', '5-July'] )

3-July    0.3
4-July    0.5
5-July    0.8
dtype: float64

<p><img src="./img/p1.png" alt="" width="300" height="100" /></p>

In [3]:
# Create a dataframe from a dictionary

city_dict = {'Latitude': 40.47, 'Longitude': 17.24, 'Elevation': 28.2}
pd.Series(city_dict)

Latitude     40.47
Longitude    17.24
Elevation    28.20
dtype: float64

In [4]:
# Create a dataframe with values and index

s1 = pd.Series([2.0, 3.1, 4.5, 8.7, 1.8], index=['mon', 'tue', 'wed', 'thu', 'fri'])
print(s1.values)
print(s1.index)

[2.  3.1 4.5 8.7 1.8]
Index(['mon', 'tue', 'wed', 'thu', 'fri'], dtype='object')

In [5]:
s1

mon    2.0
tue    3.1
wed    4.5
thu    8.7
fri    1.8
dtype: float64

### Indexing

In [6]:
s1.loc['tue'] # explicit indexing

3.1

In [7]:
s1.loc['tue'] = 5.8 # inplace value assignment

s1['tue'] # alternative explicit indexing

5.8

In [8]:
s1.iloc[2] # implicit indexing

4.5

### Slicing

In [9]:
s1.loc['mon':'wed'] # explicit slicing (stop element included)

mon    2.0
tue    5.8
wed    4.5
dtype: float64

In [10]:
s1.iloc[1:4] # implicit sclicing (stop element excluded)

tue    5.8
wed    4.5
thu    8.7
dtype: float64

### Masking

In [11]:
mask = (s1 > 2) & (s1<9)
mask

mon    False
tue     True
wed     True
thu     True
fri    False
dtype: bool

In [12]:
s1[mask]

tue    5.8
wed    4.5
thu    8.7
dtype: float64

In [13]:
mask = (s1.index == 'mon') | (s1.index == 'fri')
s1[mask]

mon    2.0
fri    1.8
dtype: float64

### Fancy indexing

In [14]:
s1.loc[['fri', 'mon']]

fri    1.8
mon    2.0
dtype: float64

In [15]:
s1.loc[['wed', 'fri']] = np.NaN
s1

mon    2.0
tue    5.8
wed    NaN
thu    8.7
fri    NaN
dtype: float64

# 2 - DataFrame

### Creation from a 2D Numpy array

<p><img src="./img/p2.png" alt="" width="280" height="100" /></p>

In [16]:
arr = np.array([[1.0, 1.4, 5.0],
                [5, 10, 8],
                [1.5, 0.3, 1.0]])
col = ['Price', 'Quantity', 'Liters']
idx = ['Water', 'Beer', 'Wine']

df = pd.DataFrame(arr, index = idx, columns = col)
df

       Price  Quantity  Liters
Water    1.0       1.4     5.0
Beer     5.0      10.0     8.0
Wine     1.5       0.3     1.0

### Creation from Pandas series

In [17]:
price = pd.Series([8.99, 29.99, 49.99], index=['cap', 'shirt', 'hoodie' ])
quantity = pd.Series([2, 2, 1], index=['cap', 'shirt', 'hoodie' ])
stock = pd.Series([12, 120, 54], index=['cap', 'shirt', 'hoodie' ])

rec_df = pd.DataFrame({'Price': price, 'Quantity': quantity, 'Stock': stock})
rec_df

        Price  Quantity  Stock
cap      8.99         2     12
shirt   29.99         2    120
hoodie  49.99         1     54

### Creation from dictionaries

In [18]:
dic_list = [{'c1': i, 'c2': i**2, 'c3': i**3} for i in range(6)]
dic_list

[{'c1': 0, 'c2': 0, 'c3': 0},
 {'c1': 1, 'c2': 1, 'c3': 1},
 {'c1': 2, 'c2': 4, 'c3': 8},
 {'c1': 3, 'c2': 9, 'c3': 27},
 {'c1': 4, 'c2': 16, 'c3': 64},
 {'c1': 5, 'c2': 25, 'c3': 125}]

In [19]:
el_df = pd.DataFrame(dic_list)
el_df

   c1  c2   c3
0   0   0    0
1   1   1    1
2   2   4    8
3   3   9   27
4   4  16   64
5   5  25  125

### Import from File

<p>It is possible to create a DataFrame reading a <strong>csv</strong> or <strong>json</strong> file. For the csv, in many cases it is important to specify the separator character, the number of rows to be skipped at the beginning of the file and all the possible null values.</p>

In [20]:
city_meteo = pd.read_json('./data/p1.json', orient ='records')

city_meteo

    Temperature  Humidity  Wind
MI         15.3      52.0   3.5
TO         16.5       NaN   2.5
NA         22.0      54.0   NaN

In [21]:
stock_2019 = pd.read_csv('./data/stock.csv', 
                         sep = ',', 
                         skiprows=1,
                         index_col = 0,
                         na_values = ['none', 'null'])
stock_2019

           Q1       Q2       Q3       Q4
Code
FB     166.69   193.00   178.08   205.17
AAPL    47.49    49.48      NaN    73.41
AMZN  1780.75  1893.63  1735.91  1847.84
NFLX   356.56   367.32   267.62   323.57
GOOG  1173.31  1080.91  1219.00  1337.02

<p>In the same way it is possible to convert a Pandas DataFrame in a file. Several extension are supported (csv, json, HTML, HDF5, SAS, ...)</p>

In [22]:
city_meteo.to_csv('./data/meteo.csv', sep=',', index = True)

In [23]:
stock_2019.to_json('./data/stock.json')

# Accessing DataFrame

In [24]:
stock_2019

           Q1       Q2       Q3       Q4
Code
FB     166.69   193.00   178.08   205.17
AAPL    47.49    49.48      NaN    73.41
AMZN  1780.75  1893.63  1735.91  1847.84
NFLX   356.56   367.32   267.62   323.57
GOOG  1173.31  1080.91  1219.00  1337.02

In [25]:
stock_2019.values # Retrurna a Numpy array with data

array([[ 166.69,  193.  ,  178.08,  205.17],
       [  47.49,   49.48,     nan,   73.41],
       [1780.75, 1893.63, 1735.91, 1847.84],
       [ 356.56,  367.32,  267.62,  323.57],
       [1173.31, 1080.91, 1219.  , 1337.02]])

### Accessing a column

In [26]:
stock_2019['Q2'] # Returns a Series with column data

Code
FB       193.00
AAPL      49.48
AMZN    1893.63
NFLX     367.32
GOOG    1080.91
Name: Q2, dtype: float64

In [27]:
stock_2019.Q3

Code
FB       178.08
AAPL        NaN
AMZN    1735.91
NFLX     267.62
GOOG    1219.00
Name: Q3, dtype: float64

### Accessing a Row

In [28]:
stock_2019.loc['GOOG'] # explicit indexing

Q1    1173.31
Q2    1080.91
Q3    1219.00
Q4    1337.02
Name: GOOG, dtype: float64

In [29]:
stock_2019.iloc[2] # implicit indexing

Q1    1780.75
Q2    1893.63
Q3    1735.91
Q4    1847.84
Name: AMZN, dtype: float64

### Slicing

In [30]:
stock_2019.loc['AAPL':'NFLX','Q2':'Q3'] # explicit indexing

           Q2       Q3
Code
AAPL    49.48      NaN
AMZN  1893.63  1735.91
NFLX   367.32   267.62

In [31]:
stock_2019.iloc[0:2, :2] # implicit indexing

          Q1      Q2
Code
FB    166.69  193.00
AAPL   47.49   49.48

### Masking

In [32]:
mask = (stock_2019['Q2'] < 1000) & (stock_2019['Q4'] > 100)
mask

Code
FB       True
AAPL    False
AMZN    False
NFLX     True
GOOG    False
dtype: bool

In [33]:
stock_2019.loc[mask, 'Q3':] # masking + slicing

          Q3      Q4
Code
FB    178.08  205.17
NFLX  267.62  323.57

### Query

In [34]:
stock_2019.query('Q2<1000 and Q4>100')

          Q1      Q2      Q3      Q4
Code
FB    166.69  193.00  178.08  205.17
NFLX  356.56  367.32  267.62  323.57

### Fancy Indexing

In [35]:
stock_2019.loc[['FB', 'GOOG'], ['Q1', 'Q4']]

           Q1       Q4
Code
FB     166.69   205.17
GOOG  1173.31  1337.02

In [36]:
mask = (stock_2019['Q2'] < 1000) & (stock_2019['Q4'] > 100)

stock_2019.loc[mask, ['Q1', 'Q3']] # masking + fancy

          Q1      Q3
Code
FB    166.69  178.08
NFLX  356.56  267.62

# Modify a DataFame

### Assign a value

In [37]:
market_df = pd.read_csv('./data/market_data.csv', header=0, sep=',', index_col=0)
market_df

         quantity    price  tax available
product
a             155    29.99   10      True
b              78    19.99   15     False
c             120    50.00   20     True
d               3  1189.99   20     True
e              85   139.99    5    False
f              42    24.99   15     True

In [38]:
market_df.loc[['a', 'd'], ['tax', 'quantity']] = np.NaN
market_df.iloc[ 1:3, 2:3] = 0

market_df # DataFrame modified inplace

         quantity    price   tax available
product
a             NaN    29.99   NaN      True
b            78.0    19.99   0.0     False
c           120.0    50.00   0.0     True
d             NaN  1189.99   NaN     True
e            85.0   139.99   5.0    False
f            42.0    24.99  15.0     True

### Adding new columns

In [39]:
# replace an existing column inplace
market_df['tax'] = pd.Series([10, 10, 20, 20, 15, 10],
                            index = ['a', 'b', 'c', 'd', 'e', 'f'])
market_df

         quantity    price  tax available
product
a             NaN    29.99   10      True
b            78.0    19.99   10     False
c           120.0    50.00   20     True
d             NaN  1189.99   20     True
e            85.0   139.99   15    False
f            42.0    24.99   10     True

In [40]:
# add a new column from a list inplace
market_df['new'] = [True, False, False, False, True, True]

market_df

         quantity    price  tax available    new
product
a             NaN    29.99   10      True   True
b            78.0    19.99   10     False  False
c           120.0    50.00   20     True   False
d             NaN  1189.99   20     True   False
e            85.0   139.99   15    False    True
f            42.0    24.99   10     True    True

### Rename columns

In [41]:
# use a dictionary which maps old names with new names
rename_dict = {'quantity' : 'Q',
               'price': 'P',
               'tax': 'T',
               'available': 'A',
               'new': 'N'}

# returns a copy of the DataFrame
market_df.rename(columns = rename_dict)

             Q        P   T       A      N
product
a          NaN    29.99  10    True   True
b         78.0    19.99  10   False  False
c        120.0    50.00  20   True   False
d          NaN  1189.99  20   True   False
e         85.0   139.99  15  False    True
f         42.0    24.99  10   True    True

### Drop Columns

In [42]:
# returns a copy of the updated dataframe
market_df.drop(columns=['price', 'tax'])

         quantity available    new
product
a             NaN      True   True
b            78.0     False  False
c           120.0     True   False
d             NaN     True   False
e            85.0    False    True
f            42.0     True    True

# 3 - Computation with Pandas

## Operations

<ul>
<li>Unary Operations on Series and DataFrames<br />
<ul>
<li>They works with any <strong>Numpy</strong> ufunc<sup>*</sup></li>
<li>The operation is applied to each element of the Series / DataFrame</li>
</ul>
</li>
<li>Operation between Series and DataFrames
<ul>
<li>Operations are performed <strong>element-wise</strong>, taking into account the indexes and columns</li>
<li>If the index and/or column do not match the result is set to <strong>NaN</strong></li>
<li>It is possible performing operations between DF and Series, with the same rules that apply for Numpy <strong>broadcasting</strong></li>
</ul>
</li>
<li>Aggregation operations
<ul>
<li>It is possible to <strong>aggregate</strong> over Series and DataFrame</li>
<li>Typcal operations are mean, std, min ,max and sum</li>
<li>For DF the aggregation is performed column-wise and <strong>returns a series</strong></li>
</ul>
</li>
</ul>
<p><sub><em><sup>*</sup>A universal function (or ufunc for short) is a function that operates on ndarrays in an element-by-element fashion, supporting array broadcasting, type casting, and several other standard features. That is, a ufunc is a &ldquo;vectorized&rdquo; wrapper for a function that takes a fixed number of specific inputs and produces a fixed number of specific outputs.</em></sub></p>

### Unary operations on Series

In [43]:
s1 = pd.Series([10, 15, 20], index = ['a', 'b', 'c'])

s1 ** 2

a    100
b    225
c    400
dtype: int64

### Unary operations on DataFrames

In [44]:
stock_2019 * 2

           Q1       Q2       Q3       Q4
Code
FB     333.38   386.00   356.16   410.34
AAPL    94.98    98.96      NaN   146.82
AMZN  3561.50  3787.26  3471.82  3695.68
NFLX   713.12   734.64   535.24   647.14
GOOG  2346.62  2161.82  2438.00  2674.04

### Operations between Series

In [56]:
s1 = pd.Series([10, 15, 10], index = ['Jan', 'Feb', 'Mar'])
s2 = pd.Series([10, 12, 20], index = ['Jan', 'Mar', 'Apr'])

s1 + s2

Apr     NaN
Feb     NaN
Jan    20.0
Mar    22.0
dtype: float64

### Operations between DataFrames

In [55]:
dict1 = {'Total': {'a': 1, 'b': 3, 'c': 5},
         'Quantity': {'a': 2, 'b': 4,'c': 6}}

df1 = pd.DataFrame(dict1)
df1

   Total  Quantity
a      1         2
b      3         4
c      5         6

In [54]:
dict2 = {'Total': {'a': 3, 'b': 4, 'c': 2, 'd':6},
         'Price': {'a': 2, 'b': 5, 'c': 5, 'd':4}}

df2 = pd.DataFrame(dict2)
df2

   Total  Price
a      3      2
b      4      5
c      2      5
d      6      4

In [57]:
df1 + df2

   Price  Quantity  Total
a    NaN       NaN    4.0
b    NaN       NaN    7.0
c    NaN       NaN    7.0
d    NaN       NaN    NaN

### Operations between DataFrames and Series

In [97]:
temp_dict = {'TO': {'Jan': 0.5, 'Feb': -2, 'Mar': 5, 'Apr':9},
             'MI': {'Jan': 1, 'Feb': -1, 'Mar': 7, 'Apr':12},
             'NA': {'Jan': 6, 'Feb': 5, 'Mar': 12, 'Apr':15}}

temp_df = pd.DataFrame(temp_dict)
temp_df

      TO  MI  NA
Jan  0.5   1   6
Feb -2.0  -1   5
Mar  5.0   7  12
Apr  9.0  12  15

In [98]:
offset = pd.Series([0.5, -1.2, 0.3], index = temp_df.columns)
offset

TO    0.5
MI   -1.2
NA    0.3
dtype: float64

In [99]:
temp_df + offset

      TO    MI    NA
Jan  1.0  -0.2   6.3
Feb -1.5  -2.2   5.3
Mar  5.5   5.8  12.3
Apr  9.5  10.8  15.3

In [100]:
temp_df.mean(axis = 'columns') # default axis = rows

Jan     2.500000
Feb     0.666667
Mar     8.000000
Apr    12.000000
dtype: float64

In [101]:
temp_df.std(axis = 'rows')

TO    4.871259
MI    5.909033
NA    4.795832
dtype: float64

In [105]:
# Z-score normalization
(temp_df - temp_df.mean())/temp_df.std()

           TO        MI        NA
Jan -0.538875 -0.634622 -0.729800
Feb -1.052089 -0.973087 -0.938315
Mar  0.384911  0.380773  0.521286
Apr  1.206054  1.226935  1.146829

## Missing Values

<p><strong>None </strong>is the&nbsp;Python keyword used to represent missing values that&nbsp;generates an object. Numpy represents missing values with&nbsp;<strong>np.NaN </strong>("Not-A-Number") which is a flotaing point number. Pandas supports both None and NaN, but typically NaN performs better with numerical computations.</p>
<p>Some important methods used to deal with missing values are:</p>
<ul>
<li>isnull( ) - Returns a boolean mask indicating null values</li>
<li>notnull( ) - Returns a boolena mask indicatin not-null values</li>
<li>dropna( ) - Returns a copy of the dataset filtered from columns or rows containing missin values</li>
<li>fillna( ) - Return a copy of the datset where the null values have been replaced with a specified techniques</li>
</ul>

In [125]:
s1 = pd.Series([10, None, 30, None, np.NaN])
s1

0    10.0
1     NaN
2    30.0
3     NaN
4     NaN
dtype: float64

In [126]:
s1.fillna(method='ffill') # propagate last valid value

0    10.0
1    10.0
2    30.0
3    30.0
4    30.0
dtype: float64

In [127]:
s1.fillna(method='bfill') # use next valid value

0    10.0
1    30.0
2    30.0
3     NaN
4     NaN
dtype: float64

In [128]:
s1.fillna(0) #fill with a defualt value

0    10.0
1     0.0
2    30.0
3     0.0
4     0.0
dtype: float64

In [129]:
s1.fillna(s1.mean()) # using the mean is a common practice (not always a good one)

0    10.0
1    20.0
2    30.0
3    20.0
4    20.0
dtype: float64

In [ ]:
dict2 = {'Total': {'a': , 'b': 4, 'c': 2, 'd':6},
         'Price': {'a': 2, 'b': 5, 'c': 5, 'd':4}}

df2 = pd.DataFrame(dict2)
df2

In [119]:
stock_2019

           Q1       Q2       Q3       Q4
Code
FB     166.69   193.00   178.08   205.17
AAPL    47.49    49.48      NaN    73.41
AMZN  1780.75  1893.63  1735.91  1847.84
NFLX   356.56   367.32   267.62   323.57
GOOG  1173.31  1080.91  1219.00  1337.02

In [110]:
stock_2019.dropna(axis='rows')

           Q1       Q2       Q3       Q4
Code
FB     166.69   193.00   178.08   205.17
AMZN  1780.75  1893.63  1735.91  1847.84
NFLX   356.56   367.32   267.62   323.57
GOOG  1173.31  1080.91  1219.00  1337.02

In [109]:
stock_2019.dropna(axis='columns')

           Q1       Q2       Q4
Code
FB     166.69   193.00   205.17
AAPL    47.49    49.48    73.41
AMZN  1780.75  1893.63  1847.84
NFLX   356.56   367.32   323.57
GOOG  1173.31  1080.91  1337.02

NotImplementedError: Currently only can fill with dict/Series column by column